In [1]:
import pandas as pd
import numpy as np

In [2]:
dict={
    "name":["ssandeep","rahiul","himanshu","golu"],
    "age":[21,22,23,24],
    "city":["jaipur","manpura","macheri","purani macheri"]
}

In [4]:
df=pd.DataFrame(dict)

In [5]:
df

       name  age            city
0  ssandeep   21          jaipur
1    rahiul   22         manpura
2  himanshu   23         macheri
3      golu   24  purani macheri

In [6]:
df.to_csv("dict.csv")

In [7]:
pd.read_csv("dict.csv")

   Unnamed: 0      name  age            city
0           0  ssandeep   21          jaipur
1           1    rahiul   22         manpura
2           2  himanshu   23         macheri
3           3      golu   24  purani macheri

In [10]:
df.head(2)

       name  age     city
0  ssandeep   21   jaipur
1    rahiul   22  manpura

In [17]:
df.to_csv("dict1.csv",index=False)

In [20]:
dict1=pd.read_csv("dict1.csv")

In [21]:
dict1

       name  age            city
0  ssandeep   21          jaipur
1    rahiul   22         manpura
2  himanshu   23         macheri
3      golu   24  purani macheri

In [24]:
dict1["name"][0]="sandeep"

C:\Users\mss2015\AppData\Local\Temp\ipykernel_4680\2350412554.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dict1["name"][0]="sandeep"

In [25]:
dict1.to_csv("dict1.csv")

In [26]:
dict1

       name  age            city
0   sandeep   21          jaipur
1    rahiul   22         manpura
2  himanshu   23         macheri
3      golu   24  purani macheri

In [27]:
dict1.dtypes

name    object
age      int64
city    object
dtype: object

In [28]:
dict1.index=["one","two","three","four"]

In [29]:
dict1

           name  age            city
one     sandeep   21          jaipur
two      rahiul   22         manpura
three  himanshu   23         macheri
four       golu   24  purani macheri

In [30]:
dict1.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [32]:
dict1.columns

Index(['name', 'age', 'city'], dtype='object')